class Math {
  static const int math = 10;
}

class Event {
  final String description;
  final String category;

  Event(this.description, this.category);
}

final List<Event> events = [
  Event('1:最近起こったいいことを言う', '緑'),
  Event('2:恋人に振られて悲しい、とりあえず飲む', '黄'),
  Event('3:誰でもいいから話を聞いてほしい。ライン、DMからランダムに選んだ人に連絡する', '赤'),
  Event('4:右隣に大好きな人が！！勢いあまってキスしちゃった', '赤'),
  Event('5:宝くじが当たった！みんなに1杯づつおごる', '赤'),
  Event('6:ストーリー投稿!', '緑'),
  Event('7:写真フォルダを10sみせる', '黄'),
  Event('8:ぶりっ子5秒', '赤'),
  Event('9:隣のグループに話しかける (写真をお願いする)', '緑'),
  Event('10:自撮りを撮る', ''),
  Event('11:左隣と位置交換(止まったマス実行)', '緑'),
  Event('12:仕事や学校の愚痴を言う', '緑'),
  Event('13:おっと口が滑った！黒歴史を話す', '赤'),
  Event('14:今持ってるグラスを空にする', '黄'),
  Event('15:コロナに感染、味覚がないからいくらでも飲めちゃう', '黄'),
  Event('16:名指しした人と一気', '黄'),
  Event('17:乞食させてください！　周りの人のお酒を少量ずつもらって混ぜて飲む', '黄'),
  Event('18:飲みたりてないんじゃない？　コールに合わせてハイ一気！', '黄'),
  Event('19:モバ充持ちお疲れ様です。　新しいグラスを頼んでスマホのバッテリー分のむ', '黄'),
  Event('20:じゃんけんで負けた人が飲む', '黄'),
  Event('21:グラスが空の人はドリンクを頼む', '黄'),
  Event('22:仲良し三人組！　両隣の人と乾杯', '黄'),
  Event('23:呑んだことないけど飲めそうなの呑んでみる', '黄'),
  Event('24:喉が渇いた、とりあえず飲む', '赤'),
  Event('25:たんおめ！　誕生日が一番近い人が飲む', '緑'),
  Event('26:緊急ダイエット企画　つぎの自分の番までなにも食べ飲みできない', '赤'),
  Event('27:飲ませたい人にお酒を飲ませる', '緑'),
  Event('28:お酒飲まなくてもいいよ?', '緑'),
  Event('29:下着を脱ぐ', '赤'),
  Event('Congratulation!!!', ''),
];
